In [1]:
# chapter 3

In [1]:
import numpy as np
import pandas as pd

In [2]:
body = np.array([[182, 169, 198, 178, 176], [81, 59, 87, 72, 79]])

In [3]:
body

array([[182, 169, 198, 178, 176],
       [ 81,  59,  87,  72,  79]])

In [4]:
# データフレーム
df = pd.DataFrame(body)

In [5]:
df

     0    1    2    3    4
0  182  169  198  178  176
1   81   59   87   72   79

In [6]:
type(body)

numpy.ndarray

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.shape

(2, 5)

In [13]:
# 列を定義
df.columns = ['Jun', 'Taka', 'Tetsu', 'Ken', 'Kazu']

In [14]:
df

   Jun  Taka  Tetsu  Ken  Kazu
0  182   169    198  178   176
1   81    59     87   72    79

In [15]:
# 行を定義
df.index = ["Height", "Weight"]

In [16]:
df

        Jun  Taka  Tetsu  Ken  Kazu
Height  182   169    198  178   176
Weight   81    59     87   72    79

In [17]:
# 列名の変更
df = df.rename(columns={'Jun':'Hikari'})

In [18]:
df

        Hikari  Taka  Tetsu  Ken  Kazu
Height     182   169    198  178   176
Weight      81    59     87   72    79

In [19]:
# 行名の変更
df = df.rename(index={"Weight":"Weight_2"})

In [20]:
df

          Hikari  Taka  Tetsu  Ken  Kazu
Height       182   169    198  178   176
Weight_2      81    59     87   72    79

In [21]:
# chapter 4

In [10]:
import numpy as np
import pandas as pd

In [11]:
df = pd.DataFrame(data=[['81', '100', '69', '78', '95'], ['78', '93', '71', '82', '89']],
                 columns=['A', 'B', 'C', 'D', 'E'], index=["AA", "BB"])

In [12]:
df

     A    B   C   D   E
AA  81  100  69  78  95
BB  78   93  71  82  89

In [13]:
df.index = ['Math', 'English']

In [14]:
df

          A    B   C   D   E
Math     81  100  69  78  95
English  78   93  71  82  89

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df.shape

(2, 5)

In [30]:
# データフレームの情報表示
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Math to English
Data columns (total 5 columns):
A    2 non-null object
B    2 non-null object
C    2 non-null object
D    2 non-null object
E    2 non-null object
dtypes: object(5)
memory usage: 96.0+ bytes

In [33]:
# データフレームの型変換
df = df.astype(int)

In [34]:
df

          A    B   C   D   E
Math     81  100  69  78  95
English  78   93  71  82  89

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, Math to English
Data columns (total 5 columns):
A    2 non-null int32
B    2 non-null int32
C    2 non-null int32
D    2 non-null int32
E    2 non-null int32
dtypes: int32(5)
memory usage: 56.0+ bytes

In [51]:
# 統計情報の確認 デスクライブ
df.describe()

              A           B          C          D          E
count   2.00000    2.000000   2.000000   2.000000   2.000000
mean   79.50000   96.500000  70.000000  80.000000  92.000000
std     2.12132    4.949747   1.414214   2.828427   4.242641
min    78.00000   93.000000  69.000000  78.000000  89.000000
25%    78.75000   94.750000  69.500000  79.000000  90.500000
50%    79.50000   96.500000  70.000000  80.000000  92.000000
75%    80.25000   98.250000  70.500000  81.000000  93.500000
max    81.00000  100.000000  71.000000  82.000000  95.000000

In [38]:
df

          A    B   C   D   E
Math     81  100  69  78  95
English  78   93  71  82  89

In [39]:
# 要素へのアクセス
df['A']

Math       81
English    78
Name: A, dtype: int32

In [40]:
type(df['A'])

pandas.core.series.Series

In [41]:
df.A

Math       81
English    78
Name: A, dtype: int32

In [15]:
# loc：名称でのアクセス
df.loc[:, ['A']]

          A
Math     81
English  78

In [16]:
df.loc['Math', ['A', 'C']]

A    81
C    69
Name: Math, dtype: object

In [17]:
df

          A    B   C   D   E
Math     81  100  69  78  95
English  78   93  71  82  89

In [18]:
# iloc：インデクスでのアクセス
df.iloc[0]

A     81
B    100
C     69
D     78
E     95
Name: Math, dtype: object

In [47]:
df.iloc[1]

A    78
B    93
C    71
D    82
E    89
Name: English, dtype: int32

In [48]:
df.iloc[0, [0]]

A    81
Name: Math, dtype: int32

In [49]:
df.iloc[:, 0:3]

          A    B   C
Math     81  100  69
English  78   93  71

In [50]:
df.iloc[0, 0:4]

A     81
B    100
C     69
D     78
Name: Math, dtype: int32

In [52]:
# chapter 5

In [19]:
import numpy as np
import pandas as pd

In [20]:
df = pd.read_csv('002-1.csv')

In [21]:
df.head()

   0.563823406  0.926037583  0.564529862
0     0.226930     0.774618     0.415330
1     0.993598     0.030036     0.210686
2     0.355566     0.824691     0.629814
3     0.784904     0.614295     0.127989
4     0.442514     0.163834     0.088494

In [22]:
# ヘッダなし
df = pd.read_csv('002-1.csv', header=None)

In [23]:
df.head()

          0         1         2
0  0.563823  0.926038  0.564530
1  0.226930  0.774618  0.415330
2  0.993598  0.030036  0.210686
3  0.355566  0.824691  0.629814
4  0.784904  0.614295  0.127989

In [59]:
df.tail()

           0         1         2
95  0.657352  0.027439  0.722030
96  0.476270  0.647409  0.543624
97  0.179071  0.901550  0.051502
98  0.793593  0.006857  0.618603
99  0.509943  0.619405  0.746515

In [60]:
type(df)

pandas.core.frame.DataFrame

In [62]:
df.shape

(100, 3)

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
0    100 non-null float64
1    100 non-null float64
2    100 non-null float64
dtypes: float64(3)
memory usage: 2.4 KB

In [65]:
df.describe()

                0           1           2
count  100.000000  100.000000  100.000000
mean     0.460883    0.487668    0.507878
std      0.278284    0.306104    0.295137
min      0.008179    0.005217    0.012975
25%      0.221251    0.209450    0.202979
50%      0.428495    0.455401    0.548508
75%      0.700257    0.761196    0.808566
max      0.994047    0.999703    0.980560

In [66]:
df2 = pd.read_csv('002-2.csv')

In [67]:
df2.head()

  Employee ID  Evaluation  Promotion Salary in JPY (Date:2001-2017)  Quit
0         565         0.1        1.0                            Low   1.0
1         141         0.1        0.0                            Low   1.0
2         786         0.6        1.0                            Low   0.0
3        1770         1.0        1.0                            Low   0.0
4         662         1.0        0.0                            Low   0.0

In [68]:
df2.shape

(201, 5)

In [69]:
df2.tail()

,Employee ID,Evaluation,Promotion,Salary in JPY (Date:2001-2017),Quit
196,596,0.2,0.0,Mid,0.0
197,1729,0.1,0.0,Mid,0.0
198,1137,1.0,1.0,Mid,0.0
199,NaN,NaN,NaN,NaN,1.0
200,"All employees data is collected annonimously, ...",NaN,NaN,NaN,NaN

In [24]:
# 199, 200行目を読み込まない
df2 = pd.read_csv('002-2.csv', skipfooter=2, engine="python")

In [25]:
df2.tail()

     Employee ID  Evaluation  Promotion Salary in JPY (Date:2001-2017)  Quit
194          766         1.0          0                            Mid     1
195         2350         0.0          0                            Mid     1
196          596         0.2          0                            Mid     0
197         1729         0.1          0                            Mid     0
198         1137         1.0          1                            Mid     0

In [26]:
df2.head()

   Employee ID  Evaluation  Promotion Salary in JPY (Date:2001-2017)  Quit
0          565         0.1          1                            Low     1
1          141         0.1          0                            Low     1
2          786         0.6          1                            Low     0
3         1770         1.0          1                            Low     0
4          662         1.0          0                            Low     0

In [27]:
df2.columns

Index(['Employee ID', 'Evaluation', 'Promotion',
       'Salary in JPY (Date:2001-2017)', 'Quit'],
      dtype='object')

In [28]:
df2.columns = ["ID", "Evaluation", "Promotion", "Salary", "Quit"]

In [29]:
df2.head()

     ID  Evaluation  Promotion Salary  Quit
0   565         0.1          1    Low     1
1   141         0.1          0    Low     1
2   786         0.6          1    Low     0
3  1770         1.0          1    Low     0
4   662         1.0          0    Low     0

In [30]:
# カラムの追加
df2["Sex"] = "Male"

In [31]:
df2.head()

     ID  Evaluation  Promotion Salary  Quit   Sex
0   565         0.1          1    Low     1  Male
1   141         0.1          0    Low     1  Male
2   786         0.6          1    Low     0  Male
3  1770         1.0          1    Low     0  Male
4   662         1.0          0    Low     0  Male

In [79]:
df2.head(20)

      ID  Evaluation  Promotion Salary  Quit   Sex
0    565         0.1          1    Low     1  Male
1    141         0.1          0    Low     1  Male
2    786         0.6          1    Low     0  Male
3   1770         1.0          1    Low     0  Male
4    662         1.0          0    Low     0  Male
5   1674         0.8          1    Low     0  Male
6    828         0.9          1    Low     1  Male
7   2287         0.9          1    Low     0  Male
8   1743         0.5          0    Low     0  Male
9    988         0.6          0    Low     0  Male
10   273         0.8          0    Low     1  Male
11  1993         0.5          0    Low     1  Male
12  1252         0.9          1    Low     0  Male
13  1349         0.7          1    Low     0  Male
14   825         0.3          1    Low     0  Male
15   110         1.0          0    Low     0  Male
16  2020         0.5          0   High     0  Male
17  1672         0.4          1   High     1  Male
18   767         0.4          1   High     1  Male
19  2218         0.3          1   High     0  Male

In [80]:
df2.describe()

                ID  Evaluation   Promotion        Quit
count   199.000000  199.000000  199.000000  199.000000
mean   1204.874372    0.474874    0.180905    0.547739
std     696.072589    0.322665    0.385910    0.498971
min       4.000000    0.000000    0.000000    0.000000
25%     601.500000    0.200000    0.000000    0.000000
50%    1146.000000    0.400000    0.000000    1.000000
75%    1839.500000    0.800000    0.000000    1.000000
max    2493.000000    1.000000    1.000000    1.000000

In [32]:
# 相関関係 コラレーション
df2.corr()

                  ID  Evaluation  Promotion      Quit
ID          1.000000   -0.020596   0.119456 -0.118589
Evaluation -0.020596    1.000000   0.231375  0.029446
Promotion   0.119456    0.231375   1.000000 -0.228676
Quit       -0.118589    0.029446  -0.228676  1.000000

In [83]:
# Evaluation でグルーピング
eva = df2.groupby('Evaluation')

In [84]:
type(eva)

pandas.core.groupby.groupby.DataFrameGroupBy

In [85]:
eva.mean()

                     ID  Promotion      Quit
Evaluation
0.0         1306.666667   0.000000  0.555556
0.1         1189.466667   0.066667  0.666667
0.2         1102.656250   0.031250  0.718750
0.3         1296.157895   0.157895  0.368421
0.4         1265.230769   0.307692  0.307692
0.5         1390.692308   0.153846  0.153846
0.6         1343.294118   0.411765  0.235294
0.7         1128.300000   0.200000  0.400000
0.8          985.600000   0.333333  0.600000
0.9         1239.360000   0.280000  0.800000
1.0         1125.000000   0.187500  0.687500

In [33]:
# chapter 6

In [34]:
import numpy as np
import pandas as pd

In [56]:
df3 = pd.read_csv('002-3.csv')

In [57]:
df3.head()

   id  Height  Weight
0   1   152.0    84.0
1   2   152.0    75.0
2   3   152.0    81.0
3   4   152.0    76.0
4   5   152.0    61.0

In [58]:
df3.shape

(146, 3)

In [59]:
# null：欠損値の確認 Trueがnullあり
df3.isnull().any()

id        False
Height     True
Weight     True
dtype: bool

In [60]:
df3.isnull().sum()

id        0
Height    9
Weight    7
dtype: int64

In [61]:
df3.head(30)

    id  Height  Weight
0    1   152.0    84.0
1    2   152.0    75.0
2    3   152.0    81.0
3    4   152.0    76.0
4    5   152.0    61.0
5    6   153.0    65.0
6    7   153.0    88.0
7    8   153.0    82.0
8    9   153.0    63.0
9   10   153.0    83.0
10  11   153.0    82.0
11  12     NaN    82.0
12  13   155.0    59.0
13  14   155.0    84.0
14  15   155.0     NaN
15  16     NaN    71.0
16  17   156.0    81.0
17  18   156.0    84.0
18  19     NaN    61.0
19  20   156.0    81.0
20  21   156.0    65.0
21  22   157.0    78.0
22  23   157.0    69.0
23  24   157.0    86.0
24  25   158.0     NaN
25  26   158.0     NaN
26  27   158.0    87.0
27  28   158.0    80.0
28  29   159.0    92.0
29  30   159.0    59.0

In [62]:
df3.tail()

      id  Height  Weight
141  142   184.0    80.0
142  143   184.0    61.0
143  144   185.0    62.0
144  145   185.0    67.0
145  146   185.0    90.0

In [63]:
# 身長でソートされているので、とりあえず１つ前の有効データで埋める df.fillna(method=ffill)：最後に有効な値の欠損データに使う
df3['Height'] = df3['Height'].fillna(method='ffill')

In [64]:
df3.head(30)

    id  Height  Weight
0    1   152.0    84.0
1    2   152.0    75.0
2    3   152.0    81.0
3    4   152.0    76.0
4    5   152.0    61.0
5    6   153.0    65.0
6    7   153.0    88.0
7    8   153.0    82.0
8    9   153.0    63.0
9   10   153.0    83.0
10  11   153.0    82.0
11  12   153.0    82.0
12  13   155.0    59.0
13  14   155.0    84.0
14  15   155.0     NaN
15  16   155.0    71.0
16  17   156.0    81.0
17  18   156.0    84.0
18  19   156.0    61.0
19  20   156.0    81.0
20  21   156.0    65.0
21  22   157.0    78.0
22  23   157.0    69.0
23  24   157.0    86.0
24  25   158.0     NaN
25  26   158.0     NaN
26  27   158.0    87.0
27  28   158.0    80.0
28  29   159.0    92.0
29  30   159.0    59.0

In [67]:
df3.isnull().sum()

id        0
Height    0
Weight    7
dtype: int64

In [70]:
# Weighthは平均値を代入
df3['Weight'] = df3['Weight'].fillna(df3['Weight'].median())

In [71]:
df3.head(30)

    id  Height  Weight
0    1   152.0    84.0
1    2   152.0    75.0
2    3   152.0    81.0
3    4   152.0    76.0
4    5   152.0    61.0
5    6   153.0    65.0
6    7   153.0    88.0
7    8   153.0    82.0
8    9   153.0    63.0
9   10   153.0    83.0
10  11   153.0    82.0
11  12   153.0    82.0
12  13   155.0    59.0
13  14   155.0    84.0
14  15   155.0    76.0
15  16   155.0    71.0
16  17   156.0    81.0
17  18   156.0    84.0
18  19   156.0    61.0
19  20   156.0    81.0
20  21   156.0    65.0
21  22   157.0    78.0
22  23   157.0    69.0
23  24   157.0    86.0
24  25   158.0    76.0
25  26   158.0    76.0
26  27   158.0    87.0
27  28   158.0    80.0
28  29   159.0    92.0
29  30   159.0    59.0

In [72]:
df3.isnull().sum()

id        0
Height    0
Weight    0
dtype: int64

In [73]:
df3.describe()

               id      Height      Weight
count  146.000000  146.000000  146.000000
mean    73.500000  167.760274   75.130137
std     42.290661    9.226128   10.175877
min      1.000000  152.000000   58.000000
25%     37.250000  161.000000   66.000000
50%     73.500000  167.000000   76.000000
75%    109.750000  175.750000   84.000000
max    146.000000  185.000000   92.000000

In [74]:
# BMI を追加する 体重 / ((身長(m) * 身長(m))

In [76]:
# BMI を列：axis=1 に追加
df3['BMI1'] = df3.apply(lambda row: row['Weight'] / ((row['Height'] / 100) ** 2), axis=1)

In [77]:
df3.head()

   id  Height  Weight       BMI1
0   1   152.0    84.0  36.357341
1   2   152.0    75.0  32.461911
2   3   152.0    81.0  35.058864
3   4   152.0    76.0  32.894737
4   5   152.0    61.0  26.402355

In [78]:
def get_bmi(row):
    return row['Weight'] / ((row['Height'] / 100) ** 2)

In [79]:
df3['BMI2'] = df3.apply(get_bmi, axis=1)

In [80]:
df3.head()

   id  Height  Weight       BMI1       BMI2
0   1   152.0    84.0  36.357341  36.357341
1   2   152.0    75.0  32.461911  32.461911
2   3   152.0    81.0  35.058864  35.058864
3   4   152.0    76.0  32.894737  32.894737
4   5   152.0    61.0  26.402355  26.402355

In [1]:
# chapter 7

In [2]:
import numpy as np
import pandas as pd

In [3]:
df4 = pd.read_csv('002-4.csv')

In [4]:
df5 = pd.read_csv('002-5.csv')

In [5]:
df4.head()

   user_id    Name  Age     Sex
0        1  Yamada   32    Male
1        2  Tanaka   45    Male
2        3   Murai   29  Female
3        4   Hoshi   38    Male

In [6]:
df5.head()

   user_id  class_id  status
0        1         3       0
1        1         2       1
2        2         1       1
3        2         6       0
4        2         3       0

In [7]:
df4.shape

(4, 4)

In [8]:
df5.shape

(9, 3)

In [9]:
# 欠損値の確認
df4.isnull().sum()

user_id    0
Name       0
Age        0
Sex        0
dtype: int64

In [10]:
df5.isnull().sum()

user_id     0
class_id    0
status      0
dtype: int64

In [11]:
# user_id で集計
user = df5.groupby('user_id')

In [12]:
user

In [13]:
user.describe()

        class_id                                                status  \
           count      mean       std  min   25%  50%   75%  max  count
user_id
1            2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0
2            3.0  3.333333  2.516611  1.0  2.00  3.0  4.50  6.0    3.0
3            3.0  4.333333  3.511885  1.0  2.50  4.0  6.00  8.0    3.0
4            1.0  9.000000       NaN  9.0  9.00  9.0  9.00  9.0    1.0


             mean       std  min   25%  50%   75%  max
user_id
1        0.500000  0.707107  0.0  0.25  0.5  0.75  1.0
2        0.333333  0.577350  0.0  0.00  0.0  0.50  1.0
3        0.666667  0.577350  0.0  0.50  1.0  1.00  1.0
4        1.000000       NaN  1.0  1.00  1.0  1.00  1.0

In [14]:
df4

   user_id    Name  Age     Sex
0        1  Yamada   32    Male
1        2  Tanaka   45    Male
2        3   Murai   29  Female
3        4   Hoshi   38    Male

In [15]:
df5

   user_id  class_id  status
0        1         3       0
1        1         2       1
2        2         1       1
3        2         6       0
4        2         3       0
5        3         1       0
6        3         4       1
7        3         8       1
8        4         9       1

In [16]:
# user_id で merge（列の結合）
df6 = pd.merge(df4, df5, on='user_id')

In [17]:
df6

   user_id    Name  Age     Sex  class_id  status
0        1  Yamada   32    Male         3       0
1        1  Yamada   32    Male         2       1
2        2  Tanaka   45    Male         1       1
3        2  Tanaka   45    Male         6       0
4        2  Tanaka   45    Male         3       0
5        3   Murai   29  Female         1       0
6        3   Murai   29  Female         4       1
7        3   Murai   29  Female         8       1
8        4   Hoshi   38    Male         9       1

In [20]:
# 人の追加　concat で列の追加
df7 = pd.DataFrame(data=[['5', '3', '0'], ['6', '5', '1'], ['7', '1', '1']], 
                  columns=['user_id', 'class_id', 'status'])

In [21]:
df7

  user_id class_id status
0       5        3      0
1       6        5      1
2       7        1      1

In [22]:
df8 = pd.concat([df5, df7])

In [23]:
df8

  user_id class_id status
0       1        3      0
1       1        2      1
2       2        1      1
3       2        6      0
4       2        3      0
5       3        1      0
6       3        4      1
7       3        8      1
8       4        9      1
0       5        3      0
1       6        5      1
2       7        1      1

In [24]:
# インデックスの振り直し
df8 = df8.reset_index(drop=True)

In [25]:
df8

   user_id class_id status
0        1        3      0
1        1        2      1
2        2        1      1
3        2        6      0
4        2        3      0
5        3        1      0
6        3        4      1
7        3        8      1
8        4        9      1
9        5        3      0
10       6        5      1
11       7        1      1

In [26]:
# 確認テスト

In [27]:
import numpy as np
import pandas as pd